tests/validation/galinat_half/0/epsilon.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.000123;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.000123;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.water;
        inletValue      uniform 0.000123;
        value           uniform 0.000123;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 1e-10;
    }
    symmetry
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
